use Vas_MyBase
select ТОВАРЫ.Наименоввание_товара, ТОВАРЫ.Цена, ЗАКАЗЫ.Вид_доставки, КЛИЕНТЫ.Наименование_фирмы_заказчика
from ТОВАРЫ 
inner join ЗАКАЗЫ on ТОВАРЫ.id_товара = ЗАКАЗЫ.id_товара 
inner join КЛИЕНТЫ on ЗАКАЗЫ.id_клиента = КЛИЕНТЫ.id_клиента
and ЗАКАЗЫ.Вид_доставки like '_сам%';


select ТОВАРЫ.Наименоввание_товара, ЗАКАЗЫ.Вид_доставки, КЛИЕНТЫ.Наименование_фирмы_заказчика,
case 
when (ТОВАРЫ.Цена between 1 and 5000) then 'цена<5000' 
when (ТОВАРЫ.Цена between 5000 and 10000) then 'цена от 5000 до 10000' 
else 'цена больше 10000'
end Ценовой_диапазон
from ТОВАРЫ 
inner join ЗАКАЗЫ on ЗАКАЗЫ.id_товара = ТОВАРЫ.id_товара
inner join КЛИЕНТЫ on КЛИЕНТЫ.id_клиента = ЗАКАЗЫ.id_клиента
order by ТОВАРЫ.Наименоввание_товара


select ТОВАРЫ.Наименоввание_товара, ЗАКАЗЫ.Вид_доставки
from ТОВАРЫ full outer join ЗАКАЗЫ on ЗАКАЗЫ.id_товара = ТОВАРЫ.id_товара


select ТОВАРЫ.Наименоввание_товара, ЗАКАЗЫ.Вид_доставки
from ТОВАРЫ cross join ЗАКАЗЫ where ЗАКАЗЫ.Вид_доставки like '%сам%'