USE Vas_MyBase;
SELECT 
    ÊËÈÅÍÒÛ.id_êëèåíòà,
    ÊËÈÅÍÒÛ.Íàèìåíîâàíèå_ôèðìû_çàêàç÷èêà
FROM 
    ÇÀÊÀÇÛ
INNER JOIN 
    ÊËÈÅÍÒÛ ON ÇÀÊÀÇÛ.id_êëèåíòà = ÊËÈÅÍÒÛ.id_êëèåíòà
INNER JOIN 
    ÒÎÂÀÐÛ ON ÇÀÊÀÇÛ.id_òîâàðà = ÒÎÂÀÐÛ.id_òîâàðà
GROUP BY 
    ÊËÈÅÍÒÛ.id_êëèåíòà, ÊËÈÅÍÒÛ.Íàèìåíîâàíèå_ôèðìû_çàêàç÷èêà
HAVING 
    SUM(ÇÀÊÀÇÛ.Êîëè÷åñòâî * ÒÎÂÀÐÛ.Öåíà) > 10000
INTERSECT 
SELECT 
    ÊËÈÅÍÒÛ.id_êëèåíòà,
    ÊËÈÅÍÒÛ.Íàèìåíîâàíèå_ôèðìû_çàêàç÷èêà
FROM 
    ÇÀÊÀÇÛ
INNER JOIN 
    ÊËÈÅÍÒÛ ON ÇÀÊÀÇÛ.id_êëèåíòà = ÊËÈÅÍÒÛ.id_êëèåíòà
INNER JOIN 
    ÒÎÂÀÐÛ ON ÇÀÊÀÇÛ.id_òîâàðà = ÒÎÂÀÐÛ.id_òîâàðà
GROUP BY 
    ÊËÈÅÍÒÛ.id_êëèåíòà, ÊËÈÅÍÒÛ.Íàèìåíîâàíèå_ôèðìû_çàêàç÷èêà
HAVING 
    SUM(ÇÀÊÀÇÛ.Êîëè÷åñòâî) > 20;
