USE Vas_MyBase;

SELECT 
    COALESCE(Клиенты.Наименование_фирмы_заказчика, 'Все клиенты') AS Клиент,
    COALESCE(Товары.Наименование_товара, 'Все товары') AS Товар,
    SUM(ЗАКАЗЫ.Количество) AS [Общее количество товаров],
    SUM(ЗАКАЗЫ.Количество * ТОВАРЫ.Цена) AS [Общая сумма покупок]
FROM 
    ЗАКАЗЫ
INNER JOIN 
    КЛИЕНТЫ ON ЗАКАЗЫ.id_клиента = КЛИЕНТЫ.id_клиента
INNER JOIN 
    ТОВАРЫ ON ЗАКАЗЫ.id_товара = ТОВАРЫ.id_товара
GROUP BY 
    ROLLUP(Клиенты.Наименование_фирмы_заказчика, Товары.Наименование_товара);


	

SELECT 
    COALESCE(Клиенты.Наименование_фирмы_заказчика, 'Все клиенты') AS Клиент,
    COALESCE(Товары.Наименование_товара, 'Все товары') AS Товар,
    SUM(ЗАКАЗЫ.Количество) AS [Общее количество товаров],
    SUM(ЗАКАЗЫ.Количество * ТОВАРЫ.Цена) AS [Общая сумма покупок]
FROM 
    ЗАКАЗЫ
INNER JOIN 
    КЛИЕНТЫ ON ЗАКАЗЫ.id_клиента = КЛИЕНТЫ.id_клиента
INNER JOIN 
    ТОВАРЫ ON ЗАКАЗЫ.id_товара = ТОВАРЫ.id_товара
GROUP BY 
    CUBE(Клиенты.Наименование_фирмы_заказчика, Товары.Наименование_товара);
