SELECT 
    Клиенты.id_клиента,
    Клиенты.Наименование_фирмы_заказчика,
    Покупки.[Общая сумма покупок],
    Покупки.Обычный AS [Количество обычных товаров],
    Покупки.Элитный AS [Количество элитных товаров],
    Покупки.Имперский AS [Количество имперских товаров]
FROM 
    КЛИЕНТЫ AS Клиенты
INNER JOIN 
    (
        SELECT 
            ЗАКАЗЫ.id_клиента,
            SUM(ЗАКАЗЫ.Количество * ТОВАРЫ.Цена) AS [Общая сумма покупок],
            SUM(CASE 
                    WHEN ТОВАРЫ.Цена <= 7000 THEN ЗАКАЗЫ.Количество 
                    ELSE 0 
                END) AS Обычный,
            SUM(CASE 
                    WHEN ТОВАРЫ.Цена BETWEEN 7001 AND 20000 THEN ЗАКАЗЫ.Количество 
                    ELSE 0 
                END) AS Элитный,
            SUM(CASE 
                    WHEN ТОВАРЫ.Цена > 20000 THEN ЗАКАЗЫ.Количество 
                    ELSE 0 
                END) AS Имперский
        FROM 
            ЗАКАЗЫ
        INNER JOIN 
            ТОВАРЫ ON ЗАКАЗЫ.id_товара = ТОВАРЫ.id_товара
        GROUP BY 
            ЗАКАЗЫ.id_клиента
    ) AS Покупки
ON 
    Клиенты.id_клиента = Покупки.id_клиента;
